Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager
The Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager class manages a map/collection of Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup and Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar instances.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager.toolbars
The map of DM toolbars to WinForm toolbars.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager.syncRoot
The synchronization root to lock when accessing Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager.toolbars.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager class.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager.Add(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup,Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel)
Adds an Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup and its associated Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar to the collection.
controlsGroup: The Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup to add.
toolbar: The Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel to add.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager.Remove(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Removes an Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup and its associated Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar from the collection.
controlsGroup: The Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup to remove.
Returns: True if controlsGroup is found and removed; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager.TryGetToolBar(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup,Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel@)
Gets the Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel associated to the specified Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup.
controlsGroup: The Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup to get the associated Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar for.
toolbar: The Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar associated to controlsGroup, if any.
Returns: True if an associated Tekla.Structures.DirectManipulation.Adapter.Controls.PopupToolBarPanel is found; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarCollectionManager.OnToolBarDisposed(System.Object,System.EventArgs)
Handles the Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar.Disposed event.
sender: The disposed Tekla.Structures.DirectManipulation.Adapter.Controls.IPopupToolBar.
eventArgs: The arguments of the event.